scripts/load-test.yml
config:
  target: "http://127.0.0.1:4173"
  phases:
    - duration: 60
      arrivalRate: 10
scenarios:
  - flow:
      - get:
          url: "/"
      - get:
          url: "/sovereign/"
      - post:
          url: "/api/react"
          json:
            query: "What is my CET balance?"
            walletAddress: "EQCexampleaddress000000000000000000"